NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_swd.cpp
#include "psoc_swd.h"
#include "psoc_types.h"
#include <pico/stdlib.h>
#include <hardware/clocks.h>
#include <hardware/pio.h>
#include <hardware/gpio.h>

// ============================================================
// PIO SWD 传输程序
// 机器码依据 Raspberry Pi 官方 debugprobe 的 probe.pio 手工汇编而来
// （来源 raspberrypi/debugprobe，MIT License；本工程无 pioasm 集成，故内联机器码）。
// 命令字格式（TX FIFO）：| 13:9 Cmd(入口绝对地址) | 8 Dir(SWDIO 输出使能) | 7:0 Count(位数-1) |
// SWCLK 周期 = 4 个 PIO 执行周期（每 bit 2 条指令、各带 [1] 延时）。
// ------------------------------------------------------------
//  0: pull                          (write_cmd / turnaround_cmd)
//  1: out pins,1   [1] side 0       (write_bitloop) 主机在下降沿输出数据
//  2: jmp x-- 1    [1] side 1       目标在上升沿采样
//  3: pull         side 0           (get_next_cmd, wrap target) SWCLK 初始低
//  4: out x,8                       取位计数
//  5: out pindirs,1                 设置 SWDIO 方向
//  6: out pc,5                      跳转到命令入口
//  7: nop                           (read_bitloop) 循环分支补偿延时
//  8: in pins,1    [1] side 1       (read_cmd) 主机在上升沿采样
//  9: jmp x-- 7        side 0
// 10: push
// ============================================================
static const uint16_t swd_program_instructions[] = {
    0x80A0, // 0
    0x7101, // 1
    0x1941, // 2
    0x90A0, // 3
    0x6028, // 4
    0x6081, // 5
    0x60A5, // 6
    0xA042, // 7
    0x5901, // 8
    0x1047, // 9
    0x8020, // 10
};

static const struct pio_program swd_program = {
    .instructions = swd_program_instructions,
    .length = 11,
    .origin = -1,
};

namespace {
// PIO 程序标签（相对程序起点的偏移）
constexpr uint8_t PROG_WRITE_CMD    = 0;   // 也是 turnaround 入口
constexpr uint8_t PROG_GET_NEXT_CMD = 3;   // 命令分发入口（SM 启动点 / wrap target）
constexpr uint8_t PROG_READ_CMD     = 8;
constexpr uint8_t PROG_WRAP_TARGET  = 3;
constexpr uint8_t PROG_WRAP         = 10;

// SWD 电平转换器已换为 TXB 系纯推挽（hardware.txt 标注 100MHz），电气对冲/发热问题已消除
// （旧 TXS0102 自动方向+开漏取向不适配 bit-bang SWD，曾致冒烟）。故恢复到满足规格 acquire
// 窗口要求（>=1.5MHz）的 4MHz：握手远小于 400us 窗口、命中更稳；TXB 推挽 100MHz 完全支持。
constexpr float SWCLK_HZ = 4000000.0f;    // 4MHz（TXB 推挽支持；满足 acquire 窗口 >=1.5MHz）

// 单次 acquire 内整段序列的最大重试次数（有限次序列，非连续 hammer；换 TXB 后仍保留此稳健结构）。
constexpr int MAX_ACQUIRE_SEQ = 16;

// 从 psoc_types 集中定义引入（单一真源，避免魔数散落）
constexpr uint32_t SWD_IDCODE_CM0P       = psoc::SWD_IDCODE_CM0P;
constexpr uint32_t REG_TEST_MODE         = psoc::reg::TEST_MODE;
constexpr uint32_t REG_CPUSS_SYSREQ      = psoc::reg::CPUSS_SYSREQ;
constexpr uint32_t REG_CPUSS_SYSARG      = psoc::reg::CPUSS_SYSARG;
constexpr uint32_t SRAM_PARAMS_BASE      = psoc::reg::SRAM_PARAMS_BASE;
constexpr uint32_t SROM_KEY1             = psoc::srom::KEY1;
constexpr uint32_t SROM_KEY2             = psoc::srom::KEY2;
constexpr uint32_t SROM_SYSREQ_BIT       = psoc::srom::SYSREQ_BIT;
constexpr uint32_t SROM_PRIVILEGED_BIT   = psoc::srom::PRIVILEGED_BIT;
constexpr uint32_t SROM_HMASTER_BIT      = psoc::srom::HMASTER_BIT;
constexpr uint32_t SROM_REQ              = SROM_SYSREQ_BIT;
constexpr uint32_t SROM_STATUS_SUCCEEDED = psoc::srom::STATUS_SUCCEEDED;
constexpr uint32_t SROM_CMD_GET_SILICON_ID = psoc::srom::CMD_GET_SILICON_ID;
constexpr uint32_t SROM_CMD_LOAD_LATCH   = psoc::srom::CMD_LOAD_LATCH;
constexpr uint32_t SROM_CMD_PROGRAM_ROW  = psoc::srom::CMD_PROGRAM_ROW;
constexpr uint32_t SROM_CMD_ERASE_ALL    = psoc::srom::CMD_ERASE_ALL;
constexpr uint32_t SROM_CMD_CHECKSUM     = psoc::srom::CMD_CHECKSUM;
constexpr uint32_t SROM_CMD_WRITE_PROTECTION = psoc::srom::CMD_WRITE_PROTECTION;
constexpr uint32_t SROM_CMD_SET_IMO_48MHZ = psoc::srom::CMD_SET_IMO_48MHZ;

// DAP 寄存器 (apndp, addr) —— addr 为 2-bit
constexpr uint8_t DP  = 0;
constexpr uint8_t AP  = 1;
constexpr uint8_t A_IDCODE   = 0;  // DP 00b (R)
constexpr uint8_t A_CTRLSTAT = 1;  // DP 01b
constexpr uint8_t A_SELECT   = 2;  // DP 10b (W)
constexpr uint8_t A_ABORT    = 0;  // DP 00b (W) —— 写 ABORT 清 sticky error
constexpr uint8_t A_CSW      = 0;  // AP 00b
constexpr uint8_t A_TAR      = 1;  // AP 01b
constexpr uint8_t A_DRW      = 3;  // AP 11b

constexpr int SWD_WAIT_RETRIES = 4;

// AHB-AP CSW 配置（规格 Step 1A 明确值）：0x00000002 = 32-bit word 访问。
// Test Mode 编程只访问普通地址（TEST_MODE/CPUSS_SYSREQ/SYSARG/SRAM/flash），无需 PPB，故不需 HPROT。
constexpr uint32_t CSW_STD = 0x00000002;
// 特权 CSW（HPROT）：写 AIRCR(PPB) 需要。CM0+ 访问 PPB 域必须带特权位。
constexpr uint32_t CSW_PRIV = 0x03000042;

// Cortex-M0+ 系统控制：AIRCR 软复位（SYSRESETREQ）。软复位不复位 debug 域(DAP/DP)，
// 且不清 SRSS 域的 TEST_MODE 标志 → 用于 TEST_MODE workaround。
constexpr uint32_t REG_AIRCR = 0xE000ED0C;
constexpr uint32_t AIRCR_SYSRESETREQ = 0x05FA0004;   // VECTKEY(0x05FA)<<16 | SYSRESETREQ(bit2)

// Cortex-M0+ 调试寄存器（DHCSR）：debug-halt acquire 路径（对齐 OpenOCD，非 test-mode）。
constexpr uint32_t REG_DHCSR    = 0xE000EDF0;
constexpr uint32_t DHCSR_DBGKEY = 0xA05F0000;
constexpr uint32_t C_DEBUGEN    = 0x1;
constexpr uint32_t C_HALT       = 0x2;
constexpr uint32_t S_HALT       = 0x00020000;   // bit17

// bkpt-算法 SROM 执行（依据 OpenOCD psoc4.c 实证：SROM 靠 NMI，须 CPU 实际执行才被服务）。
constexpr uint32_t REG_DCRSR      = 0xE000EDF4;   // Debug Core Register Selector
constexpr uint32_t REG_DCRDR      = 0xE000EDF8;   // Debug Core Register Data
constexpr uint32_t DCRSR_REGWNR   = 0x00010000;   // bit16=写
constexpr uint32_t S_REGRDY       = 0x00010000;   // DHCSR bit16
constexpr uint32_t SROM_CODE_ADDR = 0x20000000;   // bkpt 代码地址（SRAM）
constexpr uint32_t SROM_STACK_TOP = 0x20000800;   // SROM 运行栈顶（向下；不触 params@0x100-0x188）
constexpr uint16_t THUMB_BKPT     = 0xBE00;       // bkpt #0
constexpr uint32_t XPSR_THUMB     = 0x01000000;   // T 位
// 核寄存器号（DCRSR REGSEL）：SP=13, PC=15, xPSR=16
constexpr uint8_t REG_SP   = 13;
constexpr uint8_t REG_PC   = 15;
constexpr uint8_t REG_XPSR = 16;

constexpr uint32_t SPI_DBG_MAGIC0 = 0x53504442u;
constexpr uint32_t SPI_DBG_MAGIC1 = 0x4C4E4B31u;
// ★先按 hint 地址直查, 只在不命中时才做【收窄】扫描★
// 原因是硬件安全, 不是性能: 本板 SWD 经 TXS0102 电平转换器, 而 _acquire_once() 的注释记录了实测
// 教训 —— "连续数千次事务"会把 turnaround 期的驱动对冲放大成持续大电流, 曾热损坏芯片。全 16KB
// SRAM 扫描 = 4096 次背靠背 SWD 读, 正是那个被禁止的流量模式。
// hint = 当前固件 map 文件里 .data.spi_dbg 的实际地址(0.4.38: 0x20000BAC)。固件改动后地址会变,
// 故保留兜底扫描, 但范围只覆盖 .data 段所在的低 8KB, 且带 magic 校验。
constexpr uint32_t SPI_DBG_ADDR_HINT = 0x20000BACu;
constexpr uint32_t SPI_DBG_SRAM_START = 0x20000000u;
constexpr uint32_t SPI_DBG_SRAM_END = 0x20001FFCu;
constexpr uint32_t SPI_DBG_TIMEOUT_US = 300000u;

