NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_swd.cpp
inline bool debug_timeout_reached(uint32_t deadline_us) {
    return static_cast<int32_t>(time_us_32() - deadline_us) >= 0;
}
}  // namespace

// ============================================================

SwdProgrammer::KeepAliveFn SwdProgrammer::_keepalive = nullptr;

SwdProgrammer::SwdProgrammer(uint8_t io_pin, uint8_t clk_pin, uint8_t rst_pin)
    : _io_pin(io_pin), _clk_pin(clk_pin), _rst_pin(rst_pin),
      _pio(nullptr), _sm(0), _offset(0), _ready(false), _last_idcode(0),
      _dbg_status(DEBUG_OK), _dbg_block_addr(0),
      _last_srom_status(0), _last_fail_row(0xFFFF), _last_fail_addr(0xFFFFFFFF),
      _last_verify_read(0), _last_verify_expect(0),
      _last_chip_prot(0xFF), _last_prot_raw(0), _last_rowprot0(0), _last_rowprot1(0),
      _last_acquire_status(0), _last_acquire_sysreq(0), _last_acquire_delay(0),
      _clk_trim1(0), _clk_trim3(0), _sfl_trim_word(0), _sfl_tctrim_word(0),
      _clock_config_ok(false), _clock_select(0), _clock_imo_select(0),
      _clock_trim1(0), _clock_trim2(0), _clock_trim3(0),
      _erase_scan_complete(false), _erase_flash_sum(0), _erase_flash_or(0),
      _erase_first_nonzero_addr(0xFFFFFFFFu), _erase_first_nonzero_value(0),
      _erase_words_read(0) {}

bool SwdProgrammer::init() {
    _pio = HAL_PIO0::getInstance();
    if (!_pio->init(_io_pin)) {
        return false;
    }
    // 确保 SWDIO / SWDCLK 两个引脚都交给 PIO0（init 可能因已初始化而短路）
    _pio->init_pin(_io_pin);
    _pio->init_pin(_clk_pin);

    // XRES(RST) 普通 GPIO 输出，非复位态（高）
    gpio_init(_rst_pin);
    gpio_set_dir(_rst_pin, true);
    gpio_put(_rst_pin, 1);
    _rst_ready = true;   // 本机拥有 XRES 控制权; 即使随后 release_swd() 也保留(供运行时 REBOOT_PSOC 复位)

    // SWDIO 上拉，空闲高
    gpio_pull_up(_io_pin);

    if (!_pio->load_program(&swd_program, &_offset)) {
        return false;
    }
    if (!_pio->claim_sm(&_sm)) {
        _pio->unload_program(&swd_program, _offset);
        return false;
    }

    // SWDIO + SWDCLK（连续引脚）初始方向设为输出
    uint8_t base = (_io_pin < _clk_pin) ? _io_pin : _clk_pin;
    _pio->sm_set_pindirs_out(_sm, base, 2);

    PIOStateMachineConfig cfg;
    cfg.out_base = _io_pin; cfg.out_count = 1;
    cfg.set_base = _io_pin; cfg.set_count = 1;
    cfg.in_base = _io_pin;
    cfg.sideset_base = _clk_pin;
    cfg.sideset_bit_count = 2;      // 1 个 side bit + opt 使能位
    cfg.sideset_optional = true;
    cfg.sideset_pindirs = false;
    cfg.out_shift_right = true; cfg.autopull = false; cfg.pull_threshold = 32;  // LSB first
    cfg.in_shift_right = true;  cfg.autopush = false; cfg.push_threshold = 32;
    cfg.wrap_target = _offset + PROG_WRAP_TARGET;
    cfg.wrap = _offset + PROG_WRAP;
    cfg.program_offset = _offset;
    cfg.clkdiv = (float)clock_get_hz(clk_sys) / (SWCLK_HZ * 4.0f);
    cfg.enabled = false;   // 先不启用，跳到分发入口后再启用

    if (!_pio->sm_configure(_sm, cfg)) {
        return false;
    }

    // 关键：SM 必须从命令分发入口 get_next_cmd 开始（对齐 picoprobe），
    // 否则默认从 program_offset(=write_cmd) 起跑会把命令字当数据移位，导致全乱。
    _pio->sm_exec(_sm, pio_encode_jmp(_offset + PROG_GET_NEXT_CMD));
    _pio->sm_set_enabled(_sm, true);

    _ready = true;
    return true;
}

void SwdProgrammer::update() {
    // 保留接口，无需周期性调度
}

// ---------------- PIO 传输层原语 ----------------

void SwdProgrammer::_seq_out(uint32_t data, uint8_t nbits) {
    if (nbits == 0) return;
    uint32_t cmd = ((uint32_t)(_offset + PROG_WRITE_CMD) << 9) | (1u << 8) | ((nbits - 1) & 0xFF);
    _pio->sm_put_blocking(_sm, cmd);
    _pio->sm_put_blocking(_sm, data);
}

uint32_t SwdProgrammer::_seq_in(uint8_t nbits) {
    if (nbits == 0) return 0;
    uint32_t cmd = ((uint32_t)(_offset + PROG_READ_CMD) << 9) | (0u << 8) | ((nbits - 1) & 0xFF);
    _pio->sm_put_blocking(_sm, cmd);
    uint32_t raw = _pio->sm_get_blocking(_sm);
    return raw >> (32 - nbits);   // 右对齐（读入时右移，首 bit 落在高位）
}

void SwdProgrammer::_turnaround(uint8_t nbits) {
    if (nbits == 0) return;
    // 复用 write 入口但 Dir=0：SWDIO 高阻，仅产生时钟
    uint32_t cmd = ((uint32_t)(_offset + PROG_WRITE_CMD) << 9) | (0u << 8) | ((nbits - 1) & 0xFF);
    _pio->sm_put_blocking(_sm, cmd);
    _pio->sm_put_blocking(_sm, 0);   // dummy 数据
}

void SwdProgrammer::_line_reset() {
    _seq_out(0xFFFFFFFF, 32);
    _seq_out(0xFFFFFFFF, 32);   // >=64 clk SWDIO=1
    _seq_out(0x00000000, 8);    // idle low
}

void SwdProgrammer::_swd_connect() {
    // 纯 SW-DP line reset（规格附录C / AN84858 SwdLineReset）：>=50 clk SWDIO=HIGH → 拉低回 IDLE。
    // ★去掉 JTAG→SWD 切换序列(0xE79E)★——module-builder 精读 psoc4_progspec/an84858 结论：
    // 全文无此要求，纯 SWD 目标不需要，且多占时钟会把 acquire 握手拖出 400us 窗口。
    _seq_out(0xFFFFFFFF, 32);
    _seq_out(0xFFFFFFFF, 32);   // 64 clk 高（>=51，满足 line reset 定义）
    _seq_out(0x00000000, 8);    // 回 IDLE
}

uint8_t SwdProgrammer::_parity32(uint32_t v) {
    v ^= v >> 16;
    v ^= v >> 8;
    v ^= v >> 4;
    v ^= v >> 2;
    v ^= v >> 1;
    return (uint8_t)(v & 1u);
}

// ---------------- DP/AP 访问 ----------------

uint8_t SwdProgrammer::_swd_write(uint8_t apndp, uint8_t addr, uint32_t data) {
    uint8_t a2 = addr & 1u;
    uint8_t a3 = (addr >> 1) & 1u;
    uint8_t par = (apndp ^ 0u ^ a2 ^ a3) & 1u;   // RnW=0
    uint8_t hdr = (uint8_t)((1u << 0) | (apndp << 1) | (0u << 2) |
                            (a2 << 3) | (a3 << 4) | (par << 5) | (0u << 6) | (1u << 7));

    for (int attempt = 0; attempt <= SWD_WAIT_RETRIES; attempt++) {
        _seq_out(hdr, 8);
        _turnaround(1);
        uint8_t ack = (uint8_t)_seq_in(3);
        if (ack == ACK_WAIT && attempt < SWD_WAIT_RETRIES) {
            _turnaround(1);   // 归还总线后重试
            continue;
        }
        if (ack != ACK_OK) {
            _turnaround(1);
            return ack;
        }
        // 数据相：写传输在 ACK 后有一次 turnaround（目标释放，主机接管）
        _turnaround(1);
        _seq_out(data, 32);
        _seq_out(_parity32(data), 1);
        return ACK_OK;
    }
    return ACK_WAIT;
}

uint8_t SwdProgrammer::_swd_read(uint8_t apndp, uint8_t addr, uint32_t* data) {
    uint8_t a2 = addr & 1u;
    uint8_t a3 = (addr >> 1) & 1u;
    uint8_t par = (apndp ^ 1u ^ a2 ^ a3) & 1u;   // RnW=1
    uint8_t hdr = (uint8_t)((1u << 0) | (apndp << 1) | (1u << 2) |
                            (a2 << 3) | (a3 << 4) | (par << 5) | (0u << 6) | (1u << 7));

    for (int attempt = 0; attempt <= SWD_WAIT_RETRIES; attempt++) {
        _seq_out(hdr, 8);
        _turnaround(1);
        uint8_t ack = (uint8_t)_seq_in(3);
        if (ack == ACK_WAIT && attempt < SWD_WAIT_RETRIES) {
            _turnaround(1);   // 读 WAIT 无数据相，归还总线后重试
            continue;
        }
        if (ack != ACK_OK) {
            _turnaround(1);
            return ack;
        }
        uint32_t val = _seq_in(32);
        uint8_t rx_par = (uint8_t)_seq_in(1);
        _turnaround(1);   // 读毕归还总线给主机
        if (data) *data = val;
        if (_parity32(val) != rx_par) {
            return ACK_PARITY;
        }
        return ACK_OK;
    }
    return ACK_WAIT;
}

// ---------------- 经 TAR/DRW 访问任意 CPU 地址 ----------------

