NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_swd.cpp
bool SwdProgrammer::_write_io(uint32_t addr, uint32_t data) {
    if (_swd_write(AP, A_TAR, addr) != ACK_OK) return false;
    if (_swd_write(AP, A_DRW, data) != ACK_OK) return false;
    return true;
}

bool SwdProgrammer::_read_io(uint32_t addr, uint32_t* data) {
    if (_swd_write(AP, A_TAR, addr) != ACK_OK) return false;
    uint32_t stale = 0;
    if (_swd_read(AP, A_DRW, &stale) != ACK_OK) return false;   // AP 读有一拍延迟，丢弃
    if (_swd_read(AP, A_DRW, data) != ACK_OK) return false;
    return true;
}

// ---------------- 运行态带外 SWD 诊断 ----------------

bool SwdProgrammer::_debug_reclaim_pio() {
    if (_ready) return true;
    if (_pio == nullptr || !_pio->is_ready()) {
        _dbg_status = DEBUG_PIO_NOT_READY;
        return false;
    }

    _pio->init_pin(_io_pin);
    _pio->init_pin(_clk_pin);
    gpio_pull_up(_io_pin);
    _pio->sm_set_enabled(_sm, false);
    _pio->sm_clear_fifos(_sm);
    _pio->sm_restart(_sm);
    const uint8_t base = (_io_pin < _clk_pin) ? _io_pin : _clk_pin;
    _pio->sm_set_pindirs_out(_sm, base, 2);
    _pio->sm_exec(_sm, pio_encode_jmp(_offset + PROG_GET_NEXT_CMD));
    _pio->sm_set_enabled(_sm, true);
    _ready = true;
    return true;
}

bool SwdProgrammer::_debug_attach() {
    if (!_debug_reclaim_pio()) return false;

    _swd_connect();
    uint32_t id = 0;
    if (_swd_read(DP, A_IDCODE, &id) != ACK_OK || id != SWD_IDCODE_CM0P) {
        _dbg_status = DEBUG_IDCODE_FAILED;
        return false;
    }
    _last_idcode = id;
    if (_swd_write(DP, A_ABORT, 0x0000001Eu) != ACK_OK ||
        _swd_write(DP, A_CTRLSTAT, 0x54000000) != ACK_OK ||
        _swd_write(DP, A_SELECT, 0x00000000) != ACK_OK) {
        _dbg_status = DEBUG_DP_POWER_FAILED;
        return false;
    }
    if (_swd_write(AP, A_CSW, CSW_STD) != ACK_OK) {
        _dbg_status = DEBUG_CSW_CONFIG_FAILED;
        return false;
    }
    _dbg_status = DEBUG_OK;
    return true;
}

bool SwdProgrammer::_debug_scan(uint32_t deadline_us) {
    uint32_t previous = 0;
    bool have_previous = false;
    uint32_t reads = 0;
    for (uint32_t addr = SPI_DBG_SRAM_START; addr <= SPI_DBG_SRAM_END; addr += sizeof(uint32_t)) {
        if (debug_timeout_reached(deadline_us)) {
            _dbg_status = DEBUG_MAGIC_NOT_FOUND;
            return false;
        }
        uint32_t word = 0;
        if (!_read_io(addr, &word)) {
            _dbg_status = DEBUG_BLOCK_READ_FAILED;
            return false;
        }
        if (have_previous && previous == SPI_DBG_MAGIC0 && word == SPI_DBG_MAGIC1) {
            _dbg_block_addr = addr - sizeof(uint32_t);
            return true;
        }
        previous = word;
        have_previous = true;
        if ((++reads & 0xFFu) == 0u) _keepalive_tick();
    }
    _dbg_status = DEBUG_MAGIC_NOT_FOUND;
    return false;
}

// ---------------- SROM ----------------

// 写 Cortex-M0+ 核寄存器（PPB 域 DCRSR/DCRDR，需 CSW_PRIV，由 _connect_and_halt 已设好并保持）。
bool SwdProgrammer::_write_core_reg(uint8_t reg, uint32_t val) {
    if (!_write_io(REG_DCRDR, val)) return false;
    if (!_write_io(REG_DCRSR, ((uint32_t)reg & 0x7Fu) | DCRSR_REGWNR)) return false;
    absolute_time_t deadline = make_timeout_time_ms(50);
    uint32_t d = 0;
    do {
        if (!_read_io(REG_DHCSR, &d)) return false;
        if (d & S_REGRDY) return true;
    } while (!time_reached(deadline));
    return false;
}

// test-mode 下由 boot ROM 服务 SROM 请求；主机经 DAP 写 SYSREQ 后轮询完成状态。
bool SwdProgrammer::_srom_exec(uint32_t cmd) {
    if (!_write_io(REG_CPUSS_SYSREQ, SROM_REQ | cmd)) { _last_srom_status = 0xDEAD0012u; return false; }
    absolute_time_t deadline = make_timeout_time_ms(1000);
    uint32_t st = 0;
    do {
        if (!_read_io(REG_CPUSS_SYSREQ, &st)) { _last_srom_status = 0xDEAD0011u; return false; }
        if ((st & (SROM_SYSREQ_BIT | SROM_PRIVILEGED_BIT)) == 0) {
            uint32_t code = 0;
            if (!_read_io(REG_CPUSS_SYSARG, &code)) { _last_srom_status = 0xDEAD0013u; return false; }
            _last_srom_status = code;
            return (code & 0xF0000000u) == SROM_STATUS_SUCCEEDED;
        }
    } while (!time_reached(deadline));
    _last_srom_status = 0xDEAD00FFu;
    return false;
}

// ---------------- 公共接口 ----------------

// 编程模式获取：按规格在 XRES 后的启动窗口内完成 DAP 连接和 TEST_MODE 握手，
// 然后等待 SROM 释放 PRIVILEGED 位。
bool SwdProgrammer::acquire() {
    if (!_ready) return false;
    // 保护性：外层重试 20→6，配合有限次序列，避免长时间连续驱动 SWD 线（防 TXS0102 对冲发热）。
    for (uint32_t attempt = 0; attempt < 6; attempt++) {
        gpio_put(_rst_pin, 0); sleep_us(100); gpio_put(_rst_pin, 1);
        bool entered = false;
        absolute_time_t win = make_timeout_time_ms(5);
        do {
            _line_reset();
            uint32_t id = 0;
            if (_swd_read(DP, A_IDCODE, &id) != ACK_OK || id != SWD_IDCODE_CM0P) continue;
            _last_idcode = id;
            if (_swd_write(DP, A_CTRLSTAT, 0x54000000) != ACK_OK) continue;
            if (_swd_write(DP, A_SELECT,   0x00000000) != ACK_OK) continue;
            if (_swd_write(AP, A_CSW,      CSW_STD)    != ACK_OK) continue;
            if (!_write_io(REG_TEST_MODE, 0x80000000)) continue;
            uint32_t tm = 0;
            if (!_read_io(REG_TEST_MODE, &tm)) continue;
            if ((tm & 0x80000000u) == 0x80000000u) { entered = true; break; }
        } while (!time_reached(win));
        if (!entered) continue;
        absolute_time_t rdy = make_timeout_time_ms(1000);
        uint32_t sr = 0;
        do {
            if (!_read_io(REG_CPUSS_SYSREQ, &sr)) break;
            _last_acquire_sysreq = sr;
            if ((sr & SROM_PRIVILEGED_BIT) == 0) {
                _read_io(REG_CPUSS_SYSARG, &_last_acquire_status);
                _last_acquire_delay = attempt;
                return true;
            }
        } while (!time_reached(rdy));
    }
    _last_acquire_delay = 0xFFFFFFFFu;
    return false;
}

bool SwdProgrammer::set_program_indicator() {
    using namespace psoc;
    if (!_ready) return false;

    // 等价于 generated Cy_GPIO_Pin_Init(P1.6, out=1, STRONG_IN_OFF, HSIOM_GPIO)。
    // 先置输出锁存，再启用驱动，避免短暂低脉冲；所有地址/位域来自本地 PDL。
    if (!_write_io(reg::GPIO_PRT1_DR_SET, reg::STATUS_LED_MASK)) return false;

    uint32_t pc = 0;
    uint32_t pc2 = 0;
    uint32_t hsiom = 0;
    if (!_read_io(reg::GPIO_PRT1_PC, &pc) ||
        !_read_io(reg::GPIO_PRT1_PC2, &pc2) ||
        !_read_io(reg::HSIOM_PRT1_SEL, &hsiom)) return false;

    pc = (pc & ~reg::STATUS_LED_PC_MASK) | reg::STATUS_LED_PC_VALUE;
    pc2 |= reg::STATUS_LED_MASK;  // STRONG_IN_OFF 的 input-buffer-disable 位
    hsiom &= ~reg::STATUS_LED_HSIOM_MASK;  // HSIOM_SEL_GPIO = 0
    if (!_write_io(reg::GPIO_PRT1_PC, pc) ||
        !_write_io(reg::GPIO_PRT1_PC2, pc2) ||
        !_write_io(reg::HSIOM_PRT1_SEL, hsiom)) return false;

    uint32_t dr_verify = 0;
    uint32_t pc_verify = 0;
    uint32_t pc2_verify = 0;
    uint32_t hsiom_verify = 0;
    return _read_io(reg::GPIO_PRT1_DR, &dr_verify) &&
           _read_io(reg::GPIO_PRT1_PC, &pc_verify) &&
           _read_io(reg::GPIO_PRT1_PC2, &pc2_verify) &&
           _read_io(reg::HSIOM_PRT1_SEL, &hsiom_verify) &&
           (dr_verify & reg::STATUS_LED_MASK) != 0 &&
           (pc_verify & reg::STATUS_LED_PC_MASK) == reg::STATUS_LED_PC_VALUE &&
           (pc2_verify & reg::STATUS_LED_MASK) != 0 &&
           (hsiom_verify & reg::STATUS_LED_HSIOM_MASK) == 0;
}

// OpenOCD 风格 debug-halt acquire：标准 DAP 连接 → DP 上电 → 标准 CSW → 写 DHCSR 停核 →
// 轮询 S_HALT。不进 test mode，不依赖 XRES 抢窗时序。依据 psoc_swd_bringup.md 根因结论。
bool SwdProgrammer::_connect_and_halt() {
    // ★connect-under-reset + halt★（诊断确证：运行中的 CapSense 固件重配了 SWD 引脚，
    // 不复位则连 IDCODE 都读不到；必须 XRES 复位后趁 ROM boot 窗口(SWD 尚可用)立即连接
    // 并写 DHCSR 停核——核一旦 halt 就不会跳到用户固件重配引脚，SWD 保活，SROM 可执行）。
    // 1. XRES 硬复位，释放后打开 boot 窗口。
    gpio_put(_rst_pin, 0);
    sleep_us(100);
    gpio_put(_rst_pin, 1);

    // 2. 窗口内尽快连接 + 停核（少事务、命中即停）。第一拍成功即在 boot 早期停核。
    absolute_time_t deadline = make_timeout_time_ms(8);
    uint32_t dhcsr = 0;
    bool halted = false;
    do {
        _line_reset();
        uint32_t id = 0;
        if (_swd_read(DP, A_IDCODE, &id) != ACK_OK || id != SWD_IDCODE_CM0P) continue;
        _last_idcode = id;
        _swd_write(DP, A_ABORT, 0x0000001Eu);                 // 清 sticky
        if (_swd_write(DP, A_CTRLSTAT, 0x54000000) != ACK_OK) continue;   // DP 上电
        if (_swd_write(DP, A_SELECT,   0x00000000) != ACK_OK) continue;
        // ★PPB 区(DHCSR 0xE000EDF0)必须用特权 CSW(HPROT)访问；CSW_STD 访问不了 PPB★
        if (_swd_write(AP, A_CSW,      CSW_PRIV)   != ACK_OK) continue;
        if (!_write_io(REG_DHCSR, DHCSR_DBGKEY | C_HALT | C_DEBUGEN)) continue;  // 停核
        if (_read_io(REG_DHCSR, &dhcsr) && (dhcsr & S_HALT)) { halted = true; break; }
    } while (!time_reached(deadline));

    // 诊断：_last_acquire_status = DHCSR（期望含 S_HALT=0x00020000）；
    //       _last_acquire_sysreq = CPUID(0xE000ED00)（MEM-AP 健全性，CM0+≈0x410CC601）。
    _last_acquire_status = dhcsr;
    uint32_t cpuid = 0xBADAC000u;
    _read_io(0xE000ED00u, &cpuid);
    _last_acquire_sysreq = cpuid;
    return halted;
}

// TEST_MODE workaround —— 对照 OpenOCD psoc4.cfg 的 PSOC4_TEST_MODE_WORKAROUND 路径。
// 顺序：连 SWD → 配 DP（特权 CSW 以便写 PPB 的 AIRCR）→ 写 TEST_MODE=1 → SYSRESETREQ 软复位
//       → 等 boot 完成（CPU 检查 TEST_MODE 停在 ROM）→ 重连 DP → 交由外层特权探针甄别。
bool SwdProgrammer::_acquire_test_mode_workaround() {
    // 1. 连接 SWD（此刻 target 在跑上一状态，未复位）。
    _swd_connect();
    uint32_t id = 0;
    if (_swd_read(DP, A_IDCODE, &id) != ACK_OK || id != SWD_IDCODE_CM0P) return false;
    _last_idcode = id;

    // 2. 初始化 DP + 上电请求 + 特权 CSW（写 AIRCR 需访问 PPB）。
    if (_swd_write(DP, A_CTRLSTAT, 0x54000000) != ACK_OK) return false;
    if (_swd_write(DP, A_SELECT,   0x00000000) != ACK_OK) return false;
    if (_swd_write(AP, A_CSW,      CSW_PRIV)   != ACK_OK) return false;

    // 3. 复位前置位 TEST_MODE（关键：软复位后 CPU 从 ROM 启动会检查它）。
    if (!_write_io(REG_TEST_MODE, 0x80000000)) return false;

    // 4. 触发 SYSRESETREQ 软复位。复位会打断当前 SWD 事务，故忽略返回值。
    _write_io(REG_AIRCR, AIRCR_SYSRESETREQ);

