NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_swd.cpp
    // 5. 等待内部复位(<1ms)+boot(<4ms)完成，CPU 检查 TEST_MODE 后停在 system ROM。
    sleep_ms(10);

    // 6. 软复位不复位 debug 域，但保险起见重连并复配 DP（探针访问 CPUSS 用标准 CSW 即可）。
    _swd_connect();
    if (_swd_read(DP, A_IDCODE, &id) != ACK_OK) return false;
    if (_swd_write(DP, A_CTRLSTAT, 0x54000000) != ACK_OK) return false;
    if (_swd_write(DP, A_SELECT,   0x00000000) != ACK_OK) return false;
    if (_swd_write(AP, A_CSW,      CSW_STD)     != ACK_OK) return false;

    // 诊断：记录复位后 TEST_MODE 读回与 CPUSS_SYSREQ。
    _read_io(REG_TEST_MODE, &_last_acquire_status);
    _read_io(REG_CPUSS_SYSREQ, &_last_acquire_sysreq);
    return true;   // 真伪由外层 _probe_programming_mode() 判定
}

bool SwdProgrammer::_acquire_once(uint32_t window_delay_us) {
    (void)window_delay_us;   // 保留签名；本实现用连续 hammer 覆盖窗口，不用固定延时扫描
    // 1. 硬复位：XRES 低脉冲 100us（规格最小 5us）。两线全程留 PIO0。
    gpio_put(_rst_pin, 0);
    sleep_us(100);
    gpio_put(_rst_pin, 1);   // 释放 XRES —— 内部复位(<1ms)+boot(<4ms) 后打开 400us 获取窗口

    // 2. ★保护性有限次序列重试（不再 8ms 连续 hammer）。★
    //    ⚠ 上一片冒烟根因 = TXS0102 电平转换器不适配 bit-bang 推挽 SWD，叠加"8ms 连续数千次事务"
    //      把 turnaround 期的驱动对冲放大成持续大电流 → 热损坏。故【绝不再连续 hammer】。
    //    规格 p21：boot code 监视【完整 acquire 序列】(line reset→读 ID→配 DP→写 TEST_MODE)，
    //      而非单寄存器值；任一步失败 loop 回 START。这里保留整段序列，但只做【有限次数 + 短预算】，
    //      每轮之间让 SWD 线回到空闲(line reset 末尾拉低+idle)，把连续驱动时间压到最小。
    //    命中窗口问题在硬件修正（换方向可控转换器 / 加串阻 / SWD 直连）前不可靠，本版仅保命。
    uint32_t id = 0;
    bool any_id = false;
    for (int seq = 0; seq < MAX_ACQUIRE_SEQ; seq++) {
        _line_reset();
        if (_swd_read(DP, A_IDCODE, &id) != ACK_OK || id != SWD_IDCODE_CM0P) continue;  // 未连上/ID 不符
        any_id = true;
        _last_idcode = id;
        _swd_write(DP, A_ABORT, 0x0000001Eu);                       // 清 sticky error
        if (_swd_write(DP, A_CTRLSTAT, 0x54000000) != ACK_OK) continue;
        if (_swd_write(DP, A_SELECT,   0x00000000) != ACK_OK) continue;
        if (_swd_write(AP, A_CSW,      CSW_STD)    != ACK_OK) continue;
        _write_io(REG_TEST_MODE, 0x80000000);                       // 写 TEST_MODE
    }
    if (!any_id) return false;   // 全程没连上 DAP → XRES/硬件问题

    // 3. 诊断：记录序列循环后的 TEST_MODE 读回(status)与 CPUSS_SYSREQ(sysreq)。
    //    真伪交外层特权探针甄别（bit31 假阳性不可信）。
    _read_io(REG_TEST_MODE, &_last_acquire_status);
    _read_io(REG_CPUSS_SYSREQ, &_last_acquire_sysreq);
    return true;
}

// 特权 SROM 探针：甄别是否真正进入编程模式（bit31 回读假阳性不可信）。
// 依据 module-builder 精读规格 Step 1A：SET_IMO=48MHz 是 erase/program 的前置（规格末步），
// 故先设 IMO 再用 ERASE_ALL 探针，避免"已进 test mode 但因时钟未设导致 ERASE 报 0xF0000012"被误判为失败。
// - 真正进入编程模式 → ERASE 返回 0xA0000000 成功（空片 VIRGIN 上 ERASE 无损，且正是最终所需操作）；
// - DEAD 态 → 0xF0000014 快速失败。
// SET_IMO 结果记入 _last_srom_status 前先被 ERASE 覆盖，故 SET_IMO 失败不影响判据（仅作前置尝试）。
bool SwdProgrammer::_probe_programming_mode() {
    // ★诊断版★：用最简的 GET_SILICON_ID(非特权 SROM)判定 test-mode 下 SROM 能否执行,
    // 并读回芯片保护状态,以定位 ERASE 的 0xF0000014(极可能是 protection≠OPEN)。
    // 结果映射(供 COM 诊断观察):
    //   imo(_last_srom_status) = GET_SILICON_ID 的 SROM 返回码(0xA0000000=SROM 在 test-mode 正常执行)
    //   sysarg(_last_acquire_status) = SYSARG 回读(silicon id 字节)
    //   sysreq(_last_acquire_sysreq) = SYSREQ 回读(family + prot[15:12])
    //   prot(_last_chip_prot) = 芯片保护模式(01=OPEN,02=PROTECTED,00=VIRGIN,04=KILL)
    uint32_t params = SROM_KEY1 | ((SROM_KEY2 + SROM_CMD_GET_SILICON_ID) << 8);
    if (!_write_io(REG_CPUSS_SYSARG, params)) return false;
    bool ok = _srom_exec(SROM_CMD_GET_SILICON_ID);
    uint32_t p0 = 0, p1 = 0;
    _read_io(REG_CPUSS_SYSARG, &p0);
    _read_io(REG_CPUSS_SYSREQ, &p1);
    _last_acquire_status = p0;
    _last_acquire_sysreq = p1;
    _last_chip_prot = (uint8_t)((p1 >> 12) & 0x0F);
    return ok;
}

// SET_IMO=48MHz：部分器件在 flash 擦/写前必需（规格 Table 1-1）。
// OpenOCD 官方实践：0xF0000013 表示本命令未在该器件实现，视为可安全忽略的"无需"信号；
// 其它任何非成功码都是真实错误。
bool SwdProgrammer::set_imo_48mhz() {
    if (!_ready) return false;
    // ★规格 + AN84858 权威：CY8C4147(41xxS plus)必须在 flash 擦/写前用 SROM SET_IMO_48MHz(0x15)
    //   设时钟，且该操作应属 Device Acquire 例程。之前"改走直接寄存器"是坏硬件(TXS0102)时代
    //   SROM 0x15 返回 0xF0000014 的妥协；换 TXB 推挽后 SWD 全链路已通，重试规格 SROM 方式。★
    // 规格伪码：Params=KEY1|((KEY2+0x15)<<8) 写 CPUSS_SYSARG(直接值)，SYSREQ 触发，PollSromStatus。
    uint32_t params = SROM_KEY1 | ((SROM_KEY2 + SROM_CMD_SET_IMO_48MHZ) << 8);
    if (!_write_io(REG_CPUSS_SYSARG, params)) { _last_srom_status = 0xDEAD0015u; return false; }
    bool srom_ok = _srom_exec(SROM_CMD_SET_IMO_48MHZ);   // _srom_exec 已把 SROM 返回码存入 _last_srom_status
    // 保留直接寄存器配置作后备（不覆盖 _last_srom_status，使 diagnose 的 imo 字段显示 SROM 结果码）。
    configure_flash_clock();
    return srom_ok;
}

bool SwdProgrammer::configure_flash_clock() {
    using namespace psoc;
    _clock_config_ok = false;
    _clock_select = 0;
    _clock_imo_select = 0;
    _clock_trim1 = 0;
    _clock_trim2 = 0;
    _clock_trim3 = 0;

    uint32_t w = 0;
    // ① 退回 24MHz 基准
    if (!_write_io(reg::CLK_IMO_SELECT, 0x0)) return false;
    // ② 读 SFLASH 48MHz 粗调 trim(LT24,字节车道1) → CLK_IMO_TRIM1
    if (!_read_io(reg::SFLASH_IMO_TRIM_LT24_WORD, &w)) return false;
    uint8_t off = (uint8_t)((w >> 8) & 0xFF);
    if (!_write_io(reg::CLK_IMO_TRIM1, off)) return false;
    // ③ 清细调
    if (!_write_io(reg::CLK_IMO_TRIM2, 0x0)) return false;
    // ④ 读 SFLASH 温漂 trim(TCTRIM_LT24,字节车道0) → CLK_IMO_TRIM3
    if (!_read_io(reg::SFLASH_IMO_TCTRIM_LT24_WORD, &w)) return false;
    uint8_t tct = (uint8_t)(w & 0xFF);
    if (!_write_io(reg::CLK_IMO_TRIM3, tct)) return false;
    sleep_us(20);   // ≥50 IMO 周期@24MHz
    // ⑥ 目标48M>24M: 先中间档44M 再48M
    if (!_write_io(reg::CLK_IMO_SELECT, 0x5)) return false;
    sleep_us(20);
    if (!_write_io(reg::CLK_IMO_SELECT, 0x6)) return false;
    sleep_us(20);
    // ⑦ CLK_SELECT 读-改-写: PUMP_SEL[5:4]=1(IMO), HFCLK源=IMO, HFCLK_DIV=/1
    if (!_read_io(reg::CLK_SELECT, &w)) return false;
    w = (w & ~(0x3u << 4)) | (0x1u << 4);
    w = (w & ~(0x3u << 2)) | (0x0u << 2);
    w = (w & ~(0x3u << 0)) | (0x0u << 0);
    if (!_write_io(reg::CLK_SELECT, w)) return false;

    // 保存擦除实际使用的五个时钟寄存器；任一回读失败都视为配置失败。
    if (!_read_io(reg::CLK_SELECT, &_clock_select)) return false;
    if (!_read_io(reg::CLK_IMO_SELECT, &_clock_imo_select)) return false;
    if (!_read_io(reg::CLK_IMO_TRIM1, &_clock_trim1)) return false;
    if (!_read_io(reg::CLK_IMO_TRIM2, &_clock_trim2)) return false;
    if (!_read_io(reg::CLK_IMO_TRIM3, &_clock_trim3)) return false;

    _clock_config_ok = (_clock_imo_select & 0x7u) == 0x6u &&
                       ((_clock_select >> 4) & 0x3u) == 0x1u &&
                       ((_clock_select >> 2) & 0x3u) == 0x0u &&
                       (_clock_select & 0x3u) == 0x0u;
    return _clock_config_ok;
}

bool SwdProgrammer::read_clk_trim_snapshot() {
    using namespace psoc;
    bool ok = true;
    // t1/t3 复用为"读健康 SFLASH 出厂数据"探针,判定 flash 区 AHB 读是否工作/SFLASH 是否空白:
    //   t1 = SFLASH_SILICON_ID(0x0FFFF244,出厂硅ID,健康片必非0)
    //   t3 = 0x0FFFF240(硅ID 邻近字)
    ok &= _read_io(0x0FFFF244u, &_clk_trim1);
    ok &= _read_io(0x0FFFF240u, &_clk_trim3);
    ok &= _read_io(reg::SFLASH_IMO_TRIM_LT24_WORD, &_sfl_trim_word);      // 0x0FFFF37C(trim LT23/LT24)
    ok &= _read_io(reg::SFLASH_IMO_TCTRIM_LT24_WORD, &_sfl_tctrim_word);  // 0x0FFFF364(tctrim LT24)
    return ok;
}

