NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_swd.cpp
void SwdProgrammer::reset_target_run() {
    // ★不能用 _ready 守卫★: release_swd() 后 _ready=false 但 XRES 仍是本机 GPIO 输出,
    // 之前该守卫导致运行时 REBOOT_PSOC 静默无效(XRES 从不脉冲→PSoC 不重启→启动白灯不亮)。
    // 只要 init() 配置过 XRES(_rst_ready) 即可脉冲复位; SWD_RELEASE_TO_EXTERNAL(未 init)不驱动。
    if (!_rst_ready) return;
    gpio_set_dir(_rst_pin, true);   // 确保为输出(release_swd 后仍是 OUT, 这里冗余保险)
    // 仅脉冲 XRES 复位。复位后不发送 SWD line reset / 不进 Test Mode，
    // 目标在启动窗口内无调试握手即引导用户固件正常运行。
    gpio_put(_rst_pin, 0);
    sleep_us(2000);
    gpio_put(_rst_pin, 1);
}

void SwdProgrammer::release_swd() {
    gpio_init(_io_pin);  gpio_set_dir(_io_pin, GPIO_IN);  gpio_disable_pulls(_io_pin);
    gpio_init(_clk_pin); gpio_set_dir(_clk_pin, GPIO_IN); gpio_disable_pulls(_clk_pin);
    // XRES 保持输出高(不复位),让 PSoC 运行;若已有 reset_target_run 置高即可,这里确保为高。
    gpio_init(_rst_pin); gpio_set_dir(_rst_pin, GPIO_OUT); gpio_put(_rst_pin, 1);
    _ready = false;   // 之后不应再发起 SWD 操作
}

uint32_t SwdProgrammer::read_idcode(uint8_t* ack_out) {
    uint32_t id = 0;
    _swd_connect();
    uint8_t ack = _swd_read(DP, A_IDCODE, &id);
    if (ack_out) *ack_out = ack;
    return (ack == ACK_OK) ? id : 0;
}

bool SwdProgrammer::debug_read_spi_counters(uint32_t out_words[DEBUG_COUNTER_WORDS]) {
    if (out_words == nullptr) {
        _dbg_status = DEBUG_BLOCK_READ_FAILED;
        return false;
    }
    for (uint8_t i = 0; i < DEBUG_COUNTER_WORDS; ++i) out_words[i] = 0;

    const uint32_t deadline_us = time_us_32() + SPI_DBG_TIMEOUT_US;
    if (!_debug_attach()) return false;
    if (debug_timeout_reached(deadline_us)) {
        _dbg_status = DEBUG_MAGIC_NOT_FOUND;
        return false;
    }

    if (_dbg_block_addr != 0) {
        uint32_t magic0 = 0;
        uint32_t magic1 = 0;
        if (debug_timeout_reached(deadline_us) ||
            !_read_io(_dbg_block_addr, &magic0) ||
            !_read_io(_dbg_block_addr + sizeof(uint32_t), &magic1)) {
            _dbg_status = DEBUG_BLOCK_READ_FAILED;
            return false;
        }
        if (magic0 != SPI_DBG_MAGIC0 || magic1 != SPI_DBG_MAGIC1) {
            _dbg_block_addr = 0;
        }
    }

    // 先试 hint 地址(2 次读), 命中就完全避开扫描 —— 见 SPI_DBG_ADDR_HINT 处的硬件安全说明。
    if (_dbg_block_addr == 0) {
        uint32_t m0 = 0;
        uint32_t m1 = 0;
        if (_read_io(SPI_DBG_ADDR_HINT, &m0) &&
            _read_io(SPI_DBG_ADDR_HINT + sizeof(uint32_t), &m1) &&
            m0 == SPI_DBG_MAGIC0 && m1 == SPI_DBG_MAGIC1) {
            _dbg_block_addr = SPI_DBG_ADDR_HINT;
        }
    }

    if (_dbg_block_addr == 0 && !_debug_scan(deadline_us)) return false;

    for (uint8_t i = 0; i < DEBUG_COUNTER_WORDS; ++i) {
        if (debug_timeout_reached(deadline_us) ||
            !_read_io(_dbg_block_addr + 8u + static_cast<uint32_t>(i) * sizeof(uint32_t), &out_words[i])) {
            _dbg_status = DEBUG_BLOCK_READ_FAILED;
            return false;
        }
    }
    _dbg_status = DEBUG_OK;
    return true;
}

bool SwdProgrammer::read_silicon_id(uint32_t* out_id) {
    if (!_ready || out_id == nullptr) return false;

    uint32_t params = SROM_KEY1 | ((SROM_KEY2 + SROM_CMD_GET_SILICON_ID) << 8);
    if (!_write_io(REG_CPUSS_SYSARG, params)) return false;
    if (!_srom_exec(SROM_CMD_GET_SILICON_ID)) return false;

    uint32_t p0 = 0, p1 = 0;
    if (!_read_io(REG_CPUSS_SYSARG, &p0)) return false;
    if (!_read_io(REG_CPUSS_SYSREQ, &p1)) return false;

    uint8_t hi  = (p0 >> 8) & 0xFF;
    uint8_t lo  = (p0 >> 0) & 0xFF;
    uint8_t rev = (p0 >> 16) & 0xFF;
    uint8_t fam = (p1 >> 0) & 0xFF;
    *out_id = ((uint32_t)hi << 24) | ((uint32_t)lo << 16) | ((uint32_t)rev << 8) | fam;
    // 芯片保护模式在 CPUSS_SYSREQ[15:12]（GET_SILICON_ID 副产物）
    return true;
}

// 经 SFLASH macro0 读取芯片级保护模式。
bool SwdProgrammer::read_chip_protection(uint8_t* out_prot) {
    if (out_prot == nullptr) return false;

    uint32_t addr = psoc::reg::SFLASH_MACRO0 + ROW_SIZE - 4;
    uint32_t v = 0;
    if (!_read_io(addr, &v)) return false;

    _last_prot_raw = v;
    uint8_t stored = (uint8_t)((v >> 24) & 0x0F);
    if (stored == 0x00) {
        stored = psoc::chip_prot::OPEN;
    } else if (stored == 0x01) {
        stored = psoc::chip_prot::VIRGIN;
    }
    _last_chip_prot = stored;
    *out_prot = stored;
    return true;
}

// 需先 acquire() 成功。读取 16 个 row protection word 并返回其按位 OR。
uint32_t SwdProgrammer::read_row_protection() {
    uint32_t protection = 0;
    for (uint8_t i = 0; i < 16; i++) {
        uint32_t w = 0;
        if (!_read_io(psoc::reg::SFLASH_MACRO0 + (uint32_t)(i * 4), &w)) {
            _last_rowprot0 = 0xBADBAD00u;
            return 0xFFFFFFFFu;
        }
        if (i == 0) _last_rowprot0 = w;
        if (i == 1) _last_rowprot1 = w;
        protection |= w;
    }
    return protection;
}

// ---------------- Flash 编程流程（SROM） ----------------

void SwdProgrammer::_scan_erased_flash() {
    _erase_scan_complete = false;
    _erase_flash_sum = 0;
    _erase_flash_or = 0;
    _erase_first_nonzero_addr = 0xFFFFFFFFu;
    _erase_first_nonzero_value = 0;
    _erase_words_read = 0;

    for (uint32_t addr = 0; addr < psoc::flash::SIZE; addr += sizeof(uint32_t)) {
        uint32_t value = 0;
        if (!_read_io(addr, &value)) break;
        _erase_flash_sum += (value & 0xFFu) + ((value >> 8) & 0xFFu) +
                            ((value >> 16) & 0xFFu) + ((value >> 24) & 0xFFu);
        _erase_flash_or |= value;
        if (_erase_first_nonzero_addr == 0xFFFFFFFFu && value != 0) {
            _erase_first_nonzero_addr = addr;
            _erase_first_nonzero_value = value;
        }
        ++_erase_words_read;
        if ((_erase_words_read & 0x3FFu) == 0u) _keepalive_tick();   // 32K 字全片扫描: 定期保活
    }
    _erase_scan_complete = _erase_words_read == psoc::flash::SIZE / sizeof(uint32_t);
}

bool SwdProgrammer::erase_all() {
    if (!_ready) return false;
    _erase_scan_complete = false;
    _erase_flash_sum = 0;
    _erase_flash_or = 0;
    _erase_first_nonzero_addr = 0xFFFFFFFFu;
    _erase_first_nonzero_value = 0;
    _erase_words_read = 0;
    if (!configure_flash_clock()) { _last_srom_status = 0xC10C0000u; return false; }  // 时钟配置失败哨兵

    // 先读当前芯片保护模式，决定擦除路径（对照 AN84858 EraseAllFlash）。
    // 目标始终为 OPEN；PROTECTED 状态下直接 ERASE_ALL 会被拒（NA_IN_DEAD_MODE）。
    uint8_t prot = 0xFF;
    if (!read_chip_protection(&prot)) return false;

    if (prot == psoc::chip_prot::PROTECTED) {
        // PROTECTED → OPEN：WRITE_PROTECTION 写 OPEN(0x01)、macro 0，同时擦全片，
        // 之后必须重新 acquire 使芯片进入 OPEN 编程态。参数走寄存器（非 SRAM）。
        uint32_t params = SROM_KEY1 | ((SROM_KEY2 + SROM_CMD_WRITE_PROTECTION) << 8) |
                          ((uint32_t)psoc::chip_prot::OPEN << 16) | (0x00u << 24);
        if (!_write_io(REG_CPUSS_SYSARG, params)) return false;
        if (!_srom_exec(SROM_CMD_WRITE_PROTECTION)) return false;
        if (!acquire()) return false;
        (void)set_program_indicator();  // 指示失败不得阻断已擦除器件的恢复编程
        return true;
    }

    // OPEN / VIRGIN：直接 ERASE_ALL。参数走 SRAM。
    uint32_t params = SROM_KEY1 | ((SROM_KEY2 + SROM_CMD_ERASE_ALL) << 8);
    if (!_write_io(SRAM_PARAMS_BASE + 0x00, params)) return false;
    if (!_write_io(REG_CPUSS_SYSARG, SRAM_PARAMS_BASE)) return false;
    const bool erased = _srom_exec(SROM_CMD_ERASE_ALL);
    if (!erased && _last_srom_status == 0xF000000Au) {
        const uint32_t erase_status = _last_srom_status;
        _scan_erased_flash();
        _last_srom_status = erase_status;
    }
    return erased;
}

