NKQC/maimai-input-control-firmware/main_firmware/src/protocol/psoc/psoc_swd.cpp
bool SwdProgrammer::checksum_all(uint32_t* out_checksum) {
    if (!_ready || out_checksum == nullptr) return false;
    // Row ID = 0x8000 表示 "Checksum All"（用户+特权行）
    uint32_t params = SROM_KEY1 | ((SROM_KEY2 + SROM_CMD_CHECKSUM) << 8) |
                      ((0x0000u & 0x00FFu) << 16) | ((0x8000u & 0xFF00u) << 16);
    if (!_write_io(REG_CPUSS_SYSARG, params)) return false;
    if (!_srom_exec(SROM_CMD_CHECKSUM)) return false;
    uint32_t raw = 0;
    if (!_read_io(REG_CPUSS_SYSARG, &raw)) return false;
    *out_checksum = raw & 0x0FFFFFFFu;   // 28-bit 校验和
    return true;
}

bool SwdProgrammer::_srom_load_latch(uint8_t macro_id, const uint8_t* data, uint16_t len) {
    uint32_t params1 = SROM_KEY1 | ((SROM_KEY2 + SROM_CMD_LOAD_LATCH) << 8) |
                       (0x00u << 16) | ((uint32_t)macro_id << 24);
    uint32_t params2 = (uint32_t)(len - 1);   // 装载字节数 - 1
    if (!_write_io(SRAM_PARAMS_BASE + 0x00, params1)) return false;
    if (!_write_io(SRAM_PARAMS_BASE + 0x04, params2)) return false;
    // 行数据按 32-bit 小端写入 SRAM 缓冲（偏移 0x08 起）
    for (uint16_t i = 0; i < len; i += 4) {
        uint32_t w = (uint32_t)data[i] |
                     ((uint32_t)data[i + 1] << 8) |
                     ((uint32_t)data[i + 2] << 16) |
                     ((uint32_t)data[i + 3] << 24);
        if (!_write_io(SRAM_PARAMS_BASE + 0x08 + i, w)) return false;
    }
    // 诊断：回读 params1/params2/data0 三个字,确认写入 SRAM 持久(排查 latch 空的根因)。
    {
        uint32_t c0 = 0, c1 = 0, c2 = 0;
        uint32_t expect2 = (uint32_t)data[0] | ((uint32_t)data[1] << 8) |
                           ((uint32_t)data[2] << 16) | ((uint32_t)data[3] << 24);
        _read_io(SRAM_PARAMS_BASE + 0x00, &c0);
        _read_io(SRAM_PARAMS_BASE + 0x04, &c1);
        _read_io(SRAM_PARAMS_BASE + 0x08, &c2);
        if (c0 != params1)  { _last_srom_status = 0x5A5A0100u | (c0 & 0xFFFFu); return false; }
        if (c1 != params2)  { _last_srom_status = 0x5A5A0400u | (c1 & 0xFFFFu); return false; }
        if (c2 != expect2)  { _last_srom_status = 0x5A5A0800u | (c2 & 0xFFFFu); return false; }
    }
    if (!_write_io(REG_CPUSS_SYSARG, SRAM_PARAMS_BASE)) return false;
    return _srom_exec(SROM_CMD_LOAD_LATCH);
}

bool SwdProgrammer::program_row(uint16_t row_id, const uint8_t* data) {
    if (!_ready || data == nullptr) return false;
    uint8_t macro_id = (uint8_t)(row_id / ROWS_PER_MACRO);   // 128KiB / 256B = 512 行，单 macro
    // 1. 装载 latch（256 字节整行）
    if (!_srom_load_latch(macro_id, data, ROW_SIZE)) return false;
    // 2. 擦除已完成，按编程规范 Step 5 用 PROGRAM_ROW 把 latch 写入该行。
    uint32_t params = SROM_KEY1 | ((SROM_KEY2 + SROM_CMD_PROGRAM_ROW) << 8) |
                      (((uint32_t)row_id & 0x00FFu) << 16) |
                      (((uint32_t)row_id & 0xFF00u) << 16);
    if (!_write_io(SRAM_PARAMS_BASE + 0x00, params)) return false;
    if (!_write_io(REG_CPUSS_SYSARG, SRAM_PARAMS_BASE)) return false;
    return _srom_exec(SROM_CMD_PROGRAM_ROW);
}

bool SwdProgrammer::program_flash(const uint8_t* data, uint32_t len) {
    if (!_ready || data == nullptr || len == 0 || len > psoc::flash::SIZE) return false;
    if (!configure_flash_clock()) { _last_srom_status = 0xC10C0000u; return false; }
    // 镜像长度可能不是 ROW_SIZE(256) 的整数倍（生成器按 128 对齐）；向上取整为整行，
    // 末行不足部分用 0 补齐（flash 擦除态即 0，语义一致）。用 256 字节暂存缓冲避免越界读镜像。
    const uint16_t total_rows =
        static_cast<uint16_t>((len + ROW_SIZE - 1) / ROW_SIZE);
    if (total_rows > psoc::flash::ROW_COUNT) return false;
    uint8_t row_buf[ROW_SIZE];
    for (uint16_t row = 0; row < total_rows; row++) {
        const uint32_t offset = static_cast<uint32_t>(row) * ROW_SIZE;
        const uint32_t avail = (len - offset >= ROW_SIZE) ? ROW_SIZE : (len - offset);
        for (uint32_t i = 0; i < ROW_SIZE; i++) {
            row_buf[i] = (i < avail) ? data[offset + i] : 0u;
        }
        if (!program_row(row, row_buf)) {
            _last_fail_row = row;
            return false;
        }
        if ((row & 0x07u) == 0u) _keepalive_tick();   // 每 8 行(2KB)保活: 喂狗 + 泵 USB + 推进度
    }
    return true;
}

bool SwdProgrammer::verify_flash(const uint8_t* data, uint32_t len) {
    if (!_ready || data == nullptr || len == 0 || len > psoc::flash::SIZE ||
        (len % 4) != 0) return false;
    // flash 直接映射到 CPU 地址空间自 0x00000000，按 4 字节读回比对
    for (uint32_t addr = 0; addr < len; addr += 4) {
        if ((addr & 0xFFFu) == 0u) _keepalive_tick();   // 每 4KB 保活(全片校验数千次读)
        uint32_t expect = (uint32_t)data[addr] |
                          ((uint32_t)data[addr + 1] << 8) |
                          ((uint32_t)data[addr + 2] << 16) |
                          ((uint32_t)data[addr + 3] << 24);
        uint32_t w = 0;
        if (!_read_io(addr, &w)) {
            _last_fail_addr = addr;
            _last_verify_expect = expect;
            _last_verify_read = 0xBADBAD00u;
            return false;
        }
        if (w != expect) {
            _last_fail_addr = addr;
            _last_verify_expect = expect;
            _last_verify_read = w;
            return false;
        }
    }
    return true;
}
